saved_runs/prism_pimple_run/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20537;
        startFace       41063;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20537;
        startFace       61600;
    }
    inlet
    {
        type            patch;
        nFaces          16;
        startFace       82137;
    }
    outlet
    {
        type            patch;
        nFaces          16;
        startFace       82153;
    }
    lowerWall
    {
        type            patch;
        nFaces          212;
        startFace       82169;
    }
    upperWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          36;
        startFace       82381;
    }
    body
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          156;
        startFace       82417;
    }
)

// ************************************************************************* //
