saved_runs/prism_pimple_run/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

// Inherit the shared settings, then select physical time stepping
#include "controlDict.steady"

application     pimpleFoam;
endTime         1;
deltaT          0.0001;

adjustTimeStep  yes;
maxCo           0.5;
maxDeltaT       0.005;

writeControl    adjustableRunTime;
writeInterval   0.1;
timePrecision   8;

// The tutorial report uses steady-solver logs and iteration-based settings
#remove functions
functions
{
    #include "forceCoeffs"
    #include "solverInfo"
    #include "graphFunctionObject"
}
