saved_runs/prism_pimple_run/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

#include "fvSchemes.steady"

ddtSchemes
{
    default         backward;
}
